#!/usr/bin/python3
# -*- coding: utf-8 -*-

# @file simple_perceptron.py
# @brief
# @author QRS
# @blog qrsforever.github.io
# @version 1.0
# @date 2019-06-03 23:57:46

################################  jupyter-vim #######################################
# https://github.com/qrsforever/vim/blob/master/bundle/.configs/jupyter-vim_conf.vim
# %pylab --no-import-all # noqa
#####################################################################################

import numpy as np

#####################################################################################
# <codecell>
#####################################################################################
#                      ╱
#                    ╲╱
#                     ╲ ╱                                神经末梢
#          │           ╳                             ╲ /
#         ─┘╲         ╱                               ╳
#      ╳  ╱  ╲       ╱                                 ╲
#     ╱ ╲╱    ╲     ╱                                   ╳
#       ╱        *******                               ╱     ╳
#             ***       ***  轴突:转出信号到其他神经元╱     ╱ ╲
#             *   细胞核  * ══════════════════════════╲  ╳ ╱
#          ╳  ***       ***                            ╲╱ ╳
#         ╱ ╲  ╱ *******                                ╲     ╱
#     ╲  ╱   ╲╱                                          ╲   ╳
#      ╲╱    ╱                                            ╲ ╱ ╲
#      ╱    ╳                                              ╳   ╲
#          ╱ ╲
#             ╲ 树突: 接收信号
#                                            生物神经元
#
#######################################################################################
#
#
#                                    单层感知机
#                     x1  ╲
#                          ╲
#                           ╲
#                         w1 ╲       *********
#                             ╲    **         **
#                              v **             **
#                      w2       *                 *   f(z) = sign(z)
#               x2 ──────────> *  sum(w_i*x_i +b) *  ────────────────> y
#           树突                *                 *   轴突, 激活函数
#                              ^ **     z       **
#                             ╱    **         **
#                         w3 ╱       *********   b: 细胞本身自带的信号, bias偏置值
#                           ╱                    w: 输入信号有选择的接收
#                          ╱                        如果所有w=1, 输入信号全部进入
#                     x3  ╱                         如果所有w=0, 输入信号全部屏蔽
#                                                   如果w=?, 对信号有不同程度的作用
#
#######################################################################################


#
X = np.array([[1, 0, -1]]) # shape: (1, 3)
W = np.array([[-5], [0], [1]])  # shape: (3, 1)

# W最后一个值是bias(偏置)

lr = 1 # 学习率
target = 1 # 真实值

for i in range(150):
    print('%d:' % i, W)
    y = np.sign(np.dot(X, W)) # 激活函数
    if y != target:
        # 更新W值
        W = W + lr * (target - y) * X.T
    else:
        print('finished')
        break
